;-----------------------
; HYBRID CLASSES
;-----------------------
[LightRanger X2SoldierClassTemplate]
DisplayName="暗影游侠"
ClassSummary="暗影游侠是残酷的前线战士，他们已经磨练了自己的技艺来对抗我们最优秀的部队。"
AbilityTreeTitles[0]="侦察兵"
AbilityTreeTitles[1]="突击兵"
AbilityTreeTitles[2]="游侠"
AbilityTreeTitles[3]="XCOM"
;ALPHABETICAL ORDER
RandomNickNames[0]="强盗"
RandomNickNames[1]="闪电战"
RandomNickNames[2]="砖块"
RandomNickNames[3]="屠夫"
RandomNickNames[4]="电锯"
RandomNickNames[5]="卡真"
RandomNickNames[6]="剁肉"
RandomNickNames[7]="眼镜蛇"
RandomNickNames[8]="美洲狮"
RandomNickNames[9]="郊狼"
RandomNickNames[10]="碰撞"
RandomNickNames[11]="钻石"
RandomNickNames[12]="执法者"
RandomNickNames[13]="致命"
RandomNickNames[14]="闪光"
RandomNickNames[15]="狂怒"
RandomNickNames[16]="鳄鱼"
RandomNickNames[17]="幽灵"
RandomNickNames[18]="枪手" 
RandomNickNames[19]="猎犬" 
RandomNickNames[20]="冰" 
RandomNickNames[21]="冰镐" 
RandomNickNames[22]="鲨鱼" 
RandomNickNames[23]="审判日" 
RandomNickNames[24]="拳头" 
RandomNickNames[25]="怪兽" 
RandomNickNames[26]="野马" 
RandomNickNames[27]="骑士" 
RandomNickNames[28]="斗牛犬" 
RandomNickNames[29]="掠食者" 
RandomNickNames[30]="剃刀" 
RandomNickNames[31]="武士" 
RandomNickNames[32]="蝎子" 
RandomNickNames[33]="将军" 
RandomNickNames[34]="影子" 
RandomNickNames[35]="屠戮者" 
RandomNickNames[36]="蛇" 
RandomNickNames[37]="蛇眼" 
RandomNickNames[38]="独行侠" 
RandomNickNames[39]="幽灵" 
RandomNickNames[40]="蜘蛛" 
RandomNickNames[41]="潜行者" 
RandomNickNames[42]="钢铁" 
RandomNickNames[43]="螫针" 
RandomNickNames[44]="终结者" 
RandomNickNames[45]="特洛伊" 
RandomNickNames[46]="暴徒" 
RandomNickNames[47]="维京人" 
RandomNickNames[48]="守卫" 
RandomNickNames[49]="军阀" 
RandomNickNames[50]="狼獾" 
RandomNickNames[51]="野孩子" 
RandomNickNames[52]="野人" 
RandomNickNames[53]="祖鲁"
;ALPHABETICAL ORDER
RandomNickNames_Male[0]="斧头人" 
RandomNickNames_Male[1]="公爵" 
RandomNickNames_Male[2]="岩石" 
RandomNickNames_Male[3]="战马" 
RandomNickNames_Male[4]="狼人"
;ALPHABETICAL ORDER
RandomNickNames_Female[0]="雅典娜" 
RandomNickNames_Female[1]="公爵夫人" 
RandomNicknames_Female[2]="铁娘子" 
RandomNicknames_Female[3]="铁处女" 
RandomNicknames_Female[4]="盾女" 
RandomNickNames_Female[5]="女武神"
;ALPHABETICAL ORDER
PhotoboothSoloBLines_Male[0]="His blade... THEIR BLOOD!"
PhotoboothSoloBLines_Male[1]="Close quarters, no mercy."
PhotoboothSoloBLines_Male[2]="His blade will bring JUSTICE!"
PhotoboothSoloBLines_Male[3]="Close, Personal, and DEADLY!"
PhotoboothSoloBLines_Male[4]="Blademaster. Death Dealer."
PhotoboothSoloBLines_Female[0]="Her blade... THEIR BLOOD!"
PhotoboothSoloBLines_Female[1]="Close quarters, no mercy."
PhotoboothSoloBLines_Female[2]="Her blade will bring JUSTICE!"
PhotoboothSoloBLines_Female[3]="Close, Personal, and DEADLY!"
PhotoboothSoloBLines_Female[4]="Blademaster. Death Dealer."

[LightSharpshooter X2SoldierClassTemplate]
DisplayName="暗影神射手"
ClassSummary="暗影神射手是致命的狙击手，他们已经完善了他们的射击技巧来对抗我们最优秀的部队。"
AbilityTreeTitles[0]="狙击手"
AbilityTreeTitles[1]="枪神"
AbilityTreeTitles[2]="刺客"
AbilityTreeTitles[3]="XCOM"
;ALPHABETICAL ORDER
RandomNickNames[0]="顶尖" 
RandomNickNames[1]="王牌" 
RandomNickNames[2]="余波" 
RandomNickNames[3]="阿尔法" 
RandomNickNames[4]="黑杰克" 
RandomNickNames[5]="靶心" 
RandomNickNames[6]="闪电" 
RandomNickNames[7]="大佬" 
RandomNickNames[8]="长眠" 
RandomNickNames[9]="重要时刻" 
RandomNickNames[10]="老板" 
RandomNickNames[11]="靶心" 
RandomNickNames[12]="将军" 
RandomNickNames[13]="首领" 
RandomNickNames[14]="科尔特" 
RandomNickNames[15]="达拉斯" 
RandomNickNames[16]="死栓" 
RandomNickNames[17]="神射手" 
RandomNickNames[18]="僵局" 
RandomNickNames[19]="枯木" 
RandomNickNames[20]="已死" 
RandomNickNames[21]="鹰眼"
RandomNickNames[22]="八号球" 
RandomNickNames[23]="直线" 
andomNickNames[24]="比赛时间" 
RandomNickNames[25]="黑帮分子" 
RandomNickNames[26]="挖墓人" 
RandomNickNames[27]="帽子戏法" 
RandomNickNames[28]="鹰眼" 
RandomNickNames[29]="加热器" 
RandomNickNames[30]="正午" 
RandomNickNames[31]="杀手" 
RandomNickNames[32]="好莱坞" 
RandomNickNames[33]="炒作" 
RandomNickNames[34]="偶像" 
RandomNickNames[35]="豺狼" 
RandomNickNames[36]="法官" 
RandomNickNames[37]="熄灯" 
RandomNickNames[38]="封锁" 
RandomNickNames[39]="远射" 
RandomNickNames[40]="长途行者" 
RandomNickNames[41]="针" 
RandomNickNames[42]="苍白骑士" 
RandomNickNames[43]="猎人" 
RandomNickNames[44]="刮擦" 
RandomNickNames[45]="连续" 
RandomNickNames[46]="警长" 
RandomNickNames[47]="射手" 
RandomNickNames[48]="表演时间" 
RandomNickNames[49]="光滑" 
RandomNickNames[50]="投掷者" 
RandomNickNames[51]="冷酷" 
RandomNickNames[52]="清洁者" 
RandomNickNames[53]="孩子" 
RandomNickNames[54]="真相" 
RandomNickNames[55]="墓碑" 
RandomNickNames[56]="顶尖" 
RandomNickNames[57]="最高层" 
RandomNickNames[58]="双击" 
RandomNickNames[59]="送葬者" 
RandomNickNames[60]="情人节"
;ALPHABETICAL ORDER
RandomNicknames_Male[0]="牛仔" 
RandomNickNames_Male[1]="教父" 
RandomNickNames_Male[2]="邮差" 
RandomNickNames_Male[3]="沙人" 
RandomNickNames_Male[4]="瘦子" 
RandomNickNames_Male[5]="税务员" 
RandomNickNames_Male[6]="宙斯"
RandomNickNames_Female[0]="女男爵" 
RandomNickNames_Female[1]="黑寡妇" 
RandomNicknames_Female[2]="灾难" 
RandomNicknames_Female[3]="蜂后"
;ALPHABETICAL ORDER
PhotoboothSoloBLines_Male[0]="Death From Afar"
PhotoboothSoloBLines_Male[1]="Go Ahead and Run. You'll Just Die Tired."
PhotoboothSoloBLines_Male[2]="King of Killshots"
PhotoboothSoloBLines_Male[3]="Right Between Their Alien Eyes"
PhotoboothSoloBLines_Male[4]="The Only Thing He Feels is Recoil"
PhotoboothSoloBLines_Male[5]="One shot, one kill."
PhotoboothSoloBLines_Male[6]="One shot, one kill. No luck, all skill."
 _Male[7]="Patience is bitter, but its fruit is sweet."
PhotoboothSoloBLines_Male[8]="Guaranteed delivery."
PhotoboothSoloBLines_Male[9]="Save bullets.  Use a sniper."

PhotoboothSoloBLines_Female[0]="Death From Afar"
PhotoboothSoloBLines_Female[1]="Go Ahead and Run. You'll Just Die Tired."
PhotoboothSoloBLines_Female[2]="Queen of Killshots"
PhotoboothSoloBLines_Female[3]="Right Between Their Alien Eyes"
PhotoboothSoloBLines_Female[4]="The Only Thing She Feels is Recoil"
PhotoboothSoloBLines_Female[5]="One shot, one kill."
PhotoboothSoloBLines_Female[6]="One shot, one kill. No luck, all skill."
PhotoboothSoloBLines_Female[7]="Patience is bitter, but its fruit is sweet."
PhotoboothSoloBLines_Female[8]="Guaranteed delivery."
PhotoboothSoloBLines_Female[9]="Save bullets.  Use a sniper."

[LightGrenadier X2SoldierClassTemplate]
DisplayName="暗影榴弹兵"
ClassSummary="暗影榴弹兵是毁灭性的爆破专家，他们已经精炼了他们的武器库来对抗我们最优秀的部队。"
AbilityTreeTitles[0]="爆破专家"
AbilityTreeTitles[1]="重枪手"
AbilityTreeTitles[2]="破坏者"
AbilityTreeTitles[3]="XCOM"
;ALPHABETICAL ORDER
RandomNickNames[0]="全天候" 
RandomNickNames[1]="全力以赴" 
RandomNickNames[2]="野兽" 
RandomNickNames[3]="篮球手" 
RandomNickNames[4]="大国" 
RandomNickNames[5]="大款" 
RandomNickNames[6]="大恶霸" 
RandomNickNames[7]="烈焰" 
RandomNickNames[8]="砰砰" 
RandomNickNames[9]="婴儿潮一代" 
RandomNickNames[10]="轰炸机" 
RandomNickNames[11]="斗牛犬" 
RandomNickNames[12]="牛冲" 
RandomNickNames[13]="阔剑" 
RandomNickNames[14]="演示" 
RandomNickNames[15]="警戒状态" 
RandomNickNames[16]="恶魔犬" 
RandomNickNames[17]="柴油机" 
RandomNickNames[18]="安可" 
RandomNickNames[19]="火球" 
RandomNickNames[20]="冰箱" 
RandomNickNames[21]="枪手" 
RandomNickNames[22]="锤子" 
RandomNickNames[23]="地狱火" 
RandomNickNames[24]="高塔" 
RandomNickNames[25]="大个子" 
RandomNickNames[26]="火山" 
RandomNickNames[27]="飓风" 
RandomNickNames[28]="废品场" 
RandomNickNames[29]="巨无霸" 
RandomNickNames[30]="击倒" 
RandomNickNames[31]="金刚" 
RandomNickNames[32]="疯狗" 
RandomNickNames[33]="熔毁" 
RandomNickNames[34]="驼鹿" 
RandomNickNames[35]="新星" 
RandomNickNames[36]="硝基" 
RandomNickNames[37]="核弹" 
RandomNickNames[38]="食人魔" 
RandomNickNames[39]="比特犬" 
RandomNickNames[40]="纵火狂" 
RandomNickNames[41]="红线" 
RandomNickNames[42]="犀牛" 
RandomNickNames[43]="火箭" 
RandomNickNames[44]="海风" 
RandomNickNames[45]="厚板" 
RandomNickNames[46]="猛击" 
RandomNickNames[47]="喷火机" 
RandomNickNames[48]="烟雾" 
RandomNickNames[49]="沼泽怪物" 
RandomNickNames[50]="T骨" 
RandomNickNames[51]="霸王龙" 
RandomNickNames[52]="坦克" 
RandomNickNames[53]="震颤者" 
RandomNickNames[54]="雷霆" 
RandomNickNames[55]="挠痒痒" 
RandomNickNames[56]="小不点" 
RandomNickNames[57]="泰坦" 
RandomNickNames[58]="炸药" 
RandomNickNames[59]="火把" 
RandomNickNames[60]="战犬" 
RandomNickNames[61]="战马" 
RandomNickNames[62]="野孩子"
;ALPHABETICAL ORDER
RandomNicknames_Male[0]="野蛮人" 
RandomNickNames_Male[1]="大男孩" 
RandomNicknames_Male[2]="老板先生" 
RandomNickNames_Male[3]="牛仔" 
RandomNickNames_Male[4]="肌肉脑袋" 
RandomNickNames_Male[5]="尼禄" 
RandomNickNames_Male[6]="熊爸爸" 
RandomNickNames_Male[7]="野人"

RandomNickNames_Female[0]="亚马逊女战士" 
RandomNicknames_Female[1]="女老板" 
RandomNickNames_Female[2]="女牛仔" 
RandomNicknames_Female[3]="多米诺" 
RandomNickNames_Female[4]="弗丽嘉" 
RandomNickNames_Female[5]="熊妈妈" 
RandomNickNames_Female[6]="深六" 
RandomNickNames_Female[7]="火虫"
;ALPHABETICAL ORDER
PhotoboothSoloBLines_Male[0]="Bringing the Boom!"
PhotoboothSoloBLines_Male[1]="The forecast calles for... COLLATERAL DAMAGE."
PhotoboothSoloBLines_Male[2]="No Cover. No Mercy."
PhotoboothSoloBLines_Male[3]="Artillery. Danger Close."
PhotoboothSoloBLines_Male[4]="Tick, tick, BOOM!"
PhotoboothSoloBLines_Male[5]="Bombs away!"
PhotoboothSoloBLines_Male[6]="Bullets: the more the merrier!"
PhotoboothSoloBLines_Male[7]="Call him the weatherman, because he'll make it rain."
PhotoboothSoloBLines_Male[8]="Once more into the breach!"
PhotoboothSoloBLines_Male[9]="Stealth is overrated."

PhotoboothSoloBLines_Female[0]="Bringing the Boom!"
PhotoboothSoloBLines_Female[1]="The forecast calles for... COLLATERAL DAMAGE."
PhotoboothSoloBLines_Female[2]="No Cover. No Mercy."
PhotoboothSoloBLines_Female[3]="Artillery. Danger Close."
PhotoboothSoloBLines_Female[4]="Tick, tick, BOOM!"
PhotoboothSoloBLines_Female[5]="Bombs away!"
PhotoboothSoloBLines_Female[6]="Bullets: the more the merrier!"
PhotoboothSoloBLines_Female[7]="Call him the weatherman, because he'll make it rain."
PhotoboothSoloBLines_Female[8]="Once more into the breach!"
PhotoboothSoloBLines_Female[9]="Stealth is overrated."

[LightSpecialist X2SoldierClassTemplate]
DisplayName="暗影专家"
ClassSummary="暗影专家是机智的技术人员，他们利用尖端技术来对抗我们最优秀的部队。"
AbilityTreeTitles[0]="战斗黑客"
AbilityTreeTitles[1]="战斗医疗兵"
AbilityTreeTitles[2]="线人"
AbilityTreeTitles[3]="XCOM"
;ALPHABETICAL ORDER
RandomNickNames[0]="天使" 
RandomNickNames[1]="贝塔" 
RandomNickNames[2]="主教" 
RandomNickNames[3]="骨头" 
RandomNickNames[4]="破坏者" 
RandomNickNames[5]="经纪人" 
RandomNickNames[6]="加密" 
RandomNickNames[7]="赛博" 
RandomNickNames[8]="密码" 
RandomNickNames[9]="数据" 
RandomNickNames[10]="执事"
RandomNickNames[11]="感觉良好博士" 
RandomNickNames[12]="医生" 
RandomNickNames[13]="反馈" 
RandomNickNames[14]="防火墙" 
RandomNickNames[15]="天才" 
RandomNickNames[16]="小玩意" 
RandomNickNames[17]="故障" 
RandomNickNames[18]="劫持" 
RandomNickNames[19]="干扰器" 
RandomNickNames[20]="小丑" 
RandomNickNames[21]="冲击" 
RandomNickNames[22]="闪电" 
RandomNickNames[23]="求救信号" 
RandomNickNames[24]="兆" 
RandomNickNames[25]="牛顿" 
RandomNickNames[26]="超速" 
RandomNickNames[27]="补丁" 
RandomNickNames[28]="教授" 
RandomNickNames[29]="拉格泰姆" 
RandomNickNames[30]="流氓" 
RandomNickNames[31]="响尾蛇" 
RandomNickNames[32]="红色" 
RandomNickNames[33]="裂缝" 
RandomNickNames[34]="伞绳" 
RandomNickNames[35]="流氓" 
RandomNickNames[36]="焦土" 
RandomNickNames[37]="哨兵" 
RandomNickNames[38]="阴暗的" 
RandomNickNames[39]="震动" 
RandomNickNames[40]="换挡器" 
RandomNickNames[41]="心理学家" 
RandomNickNames[42]="滑块" 
RandomNickNames[43]="太阳" 
RandomNickNames[44]="声纳" 
RandomNickNames[45]="火花" 
RandomNickNames[46]="缝合" 
andomNickNames[47]="轻敲者" 
RandomNickNames[48]="泪滴" 
RandomNickNames[49]="修补匠" 
RandomNickNames[50]="涡轮" 
RandomNickNames[51]="毒液" 
RandomNickNames[52]="蒸汽" 
RandomNickNames[53]="战鸟" 
RandomNickNames[54]="看守人" 
RandomNickNames[55]="威士忌" 
RandomNickNames[56]="野东西" 
RandomNickNames[57]="祖鲁"
;ALPHABETICAL ORDER
RandomNickNames_Male[0]="糖果人" 
RandomNickNames_Male[1]="魔术师" 
RandomNickNames_Male[2]="牧师" 
andomNickNames_Male[3]="雨人" 
RandomNickNames_Male[4]="公鸡"

RandomNickNames_Female[0]="女祭司" 
RandomNickNames_Female[1]="狼母" 
RandomNickNames_Female[2]="黑寡妇" 
RandomNickNames_Female[4]="公爵夫人"
;ALPHABETICAL ORDER
PhotoboothSoloBLines_Male[0]="Hero to the Resistance.  Nightmare to its Enemies."
PhotoboothSoloBLines_Male[1]="Not all angels have wings."
PhotoboothSoloBLines_Male[2]="ADVENT's diagnosis? Terminal."
PhotoboothSoloBLines_Male[3]="There's no mercy in this angel."

PhotoboothSoloBLines_Female[0]="Hero to the Resistance.  Nightmare to its Enemies."
PhotoboothSoloBLines_Female[1]="Not all angels have wings."
PhotoboothSoloBLines_Female[2]="ADVENT's diagnosis? Terminal."
PhotoboothSoloBLines_Female[3]="There's no mercy in this angel."

[LightPsiOperative X2SoldierClassTemplate]
DisplayName="暗影灵能特工"
ClassSummary="暗影灵能特工天生具有灵能天赋，他们融合了外星技术和战斗训练，以最大化他们对我们最佳部队的攻击力。"
AbilityTreeTitles[0]="共振"
AbilityTreeTitles[1]="显像者"
AbilityTreeTitles[2]="腐化者"
AbilityTreeTitles[3]="XCOM"
RandomNickNames[0]="巫师" 
RandomNickNames[1]="女巫" 
RandomNickNames[2]="男巫" 
RandomNickNames[3]="心理变态" 
RandomNickNames[4]="挽歌" 
RandomNickNames[5]="回声" 
RandomNickNames[6]="灵体" 
RandomNickNames[7]="霾" 
RandomNickNames[8]="咒语" 
RandomNickNames[9]="禅" 
RandomNickNames[10]="欧米茄" 
RandomNickNames[11]="黄昏" 
RandomNickNames[12]="巫毒" 
RandomNickNames[13]="恶鬼" 
RandomNickNames[14]="法官" 
RandomNickNames[15]="怪胎" 
RandomNickNames[16]="抽搐" 
RandomNickNames[17]="恐惧" 
RandomNickNames[18]="食尸鬼" 
RandomNickNames[19]="奥兹" 
RandomNickNames[20]="无" 
RandomNickNames[21]="零" 
RandomNickNames[22]="灵应盘" 
RandomNickNames[23]="先知" 
RandomNickNames[24]="噩梦" 
RandomNickNames[25]="蝰蛇" 
RandomNickNames[26]="鬼魂" 
RandomNickNames[27]="恶魔" 
RandomNickNames[28]="乌鸦" 
RandomNickNames[29]="维达" 
RandomNickNames[30]="综合症" 
RandomNickNames[31]="德鲁伊" 
RandomNickNames[32]="惊悚" 
RandomNickNames[33]="凤凰" 
RandomNickNames[34]="午夜" 
RandomNickNames[35]="乌鸦" 
RandomNickNames[36]="稻草人" 
RandomNickNames[37]="吸血鬼" 
RandomNickNames[38]="狼人" 
RandomNickNames[39]="僵尸" 
RandomNickNames[40]="萤火虫" 
RandomNickNames[41]="预兆" 
RandomNickNames[42]="乌鸦" 
RandomNickNames[43]="异形" 
RandomNickNames[44]="死神" 
RandomNickNames[45]="尖叫声"

RandomNickNames_Male[0]="洛基" 
RandomNickNames_Male[1]="法老" 
RandomNicknames_Male[2]="梅林" 
RandomNicknames_Male[3]="传教士"

RandomNickNames_Female[0]="格雷女士" 
RandomNicknames_Female[1]="女巫师" 
RandomNicknames_Female[2]="女妖" 
RandomNicknames_Female[3]="极光" 
RandomNicknames_Female[4]="女预言家" 
RandomNicknames_Female[5]="痛苦" 
RandomNicknames_Female[6]="莫瑞根" 
RandomNicknames_Female[7]="紫罗兰"

RankNames[0]="新手"
RankNames[1]="见习学徒"
RankNames[2]="学徒"
RankNames[3]="学者"
RankNames[4]="大学者"
RankNames[5]="神秘者"
RankNames[6]="巫师"
RankNames[7]="法师"

ShortNames[0]="Rk."
ShortNames[1]="Int."
ShortNames[2]="Acl."
ShortNames[3]="Adp."
ShortNames[4]="Dsc."
ShortNames[5]="Mys."
ShortNames[6]="War."
ShortNames[7]="Mag."

RankIcons[0]= "UILibrary_Common.rank_rookie"
RankIcons[1]= "UILibrary_Common.psirank_initiate"
RankIcons[2]= "UILibrary_Common.psirank_acolyte"
RankIcons[3]= "UILibrary_Common.psirank_adept"
RankIcons[4]= "UILibrary_Common.psirank_disciple"
RankIcons[5]= "UILibrary_Common.psirank_mystic"
RankIcons[6]= "UILibrary_Common.psirank_warlock"
RankIcons[7]= "UILibrary_Common.psirank_magus"

PhotoboothSoloBLines_Male[0]="His greatest weapon... IS HIS MIND!"
PhotoboothSoloBLines_Female[0]="Her greatest weapon... IS HER MIND!"